druckgott/bambulab_ams_diy_esp32/src/Adafruit_NeoPixel.cpp
/*!
 * @file Adafruit_NeoPixel.cpp
 *
 * @mainpage Arduino-Bibliothek zum Ansteuern von Adafruit NeoPixel-adressierbaren LEDs, 
 *           FLORA RGB-Smart-Pixeln und kompatiblen Geräten (wie WS2811, WS2812, WS2812B, SK6812 usw.)
 *
 * @section intro_sec Einführung
 *
 * Dies ist die Dokumentation der Adafruit NeoPixel-Bibliothek für die Arduino-Plattform.  
 * Sie unterstützt verschiedene Mikrocontroller (die meisten AVR-Boards, viele ARM-Geräte, ESP8266 und ESP32 usw.)  
 * und kann Adafruit NeoPixels, FLORA RGB-Smart-Pixel sowie kompatible Geräte (wie WS2811, WS2812, WS2812B, SK6812 usw.) steuern.
 *
 * Adafruit hat Zeit und Ressourcen in die Bereitstellung dieses Open-Source-Codes investiert.  
 * Bitte unterstütze Adafruit und Open-Source-Hardware durch den Kauf von Adafruit-Produkten!
 *
 * @section author Autor
 *
 * Geschrieben von Phil "Paint Your Dragon" Burgess für Adafruit Industries,  
 * mit Beiträgen von PJRC, Michael Miller und weiteren Mitgliedern der Open-Source-Community.
 *
 * @section license Lizenz
 *
 * Diese Datei ist Teil der Adafruit_NeoPixel-Bibliothek.
 *
 * Adafruit_NeoPixel ist freie Software:  
 * Du kannst sie unter den Bedingungen der GNU Lesser General Public License (LGPL), Version 3 oder neuer,  
 * weiterveröffentlichen und/oder verändern.
 *
 * Adafruit_NeoPixel wird in der Hoffnung veröffentlicht, dass es nützlich ist,  
 * jedoch ohne jegliche Garantie – nicht einmal die implizite Garantie der Marktgängigkeit  
 * oder der Eignung für einen bestimmten Zweck. Siehe die LGPL für weitere Details.
 *
 * Eine Kopie der LGPL solltest du bereits erhalten haben. Falls nicht, siehe:  
 * <http://www.gnu.org/licenses/>.
 *
 */

#include "Adafruit_NeoPixel.h"

#if defined(TARGET_LPC1768)
#include <time.h>
#endif

#if defined(NRF52) || defined(NRF52_SERIES)
#include "nrf.h"

// Interrupt is only disabled if there is no PWM device available
// Note: Adafruit Bluefruit nrf52 does not use this option
//#define NRF52_DISABLE_INT
#endif

#if defined(ARDUINO_ARCH_NRF52840)
#if defined __has_include
#if __has_include(<pinDefinitions.h>)
#include <pinDefinitions.h>
#endif
#endif
#endif

#if defined(ARDUINO_ARCH_MBED)
#include "mbed.h"  // Needed for DigitalOut and PinName
#endif

/*!
  @brief   NeoPixel-Konstruktor, wenn Länge, Pin und Pixeltyp bereits zur Kompilierzeit bekannt sind
  @param   n  Anzahl der NeoPixel auf dem LED-Streifen
  @param   p  Arduino-Pin-Nummer, die zur Ansteuerung der NeoPixel-Daten verwendet wird
  @param   t  Pixeltyp – Summe der in Adafruit_NeoPixel.h definierten NEO_* Konstanten.  
              Beispiel: NEO_GRB + NEO_KHZ800 bedeutet ein Datenstrom von 800 kHz mit der Farb-Reihenfolge GRB
  @return  Ein Adafruit_NeoPixel-Objekt. Vor der Verwendung muss die Funktion begin() aufgerufen werden.
*/

Adafruit_NeoPixel::Adafruit_NeoPixel(uint16_t n, int16_t p, neoPixelType t)
    : begun(false), brightness(0), pixels(NULL), endTime(0) {
  updateType(t);
  updateLength(n);
  setPin(p);

#if defined(ESP32)
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
  espInit();
#endif
#endif
}

/*!
  @brief   „Leerer“ NeoPixel-Konstruktor. Wird verwendet, wenn Länge, Pin und/oder Pixeltyp 
           zur Kompilierzeit noch nicht bekannt sind. Muss anschließend mit updateType(), 
           updateLength() und setPin() initialisiert werden.
  @return  Ein Adafruit_NeoPixel-Objekt. Vor der Verwendung muss die Funktion begin() aufgerufen werden.
  @note    Diese Funktion ist veraltet und nur für die Kompatibilität mit älteren Projekten enthalten.  
           Neue Projekte sollten die Konstruktor-Syntax mit Länge, Pin und Typ verwenden.
*/

Adafruit_NeoPixel::Adafruit_NeoPixel()
    :
#if defined(NEO_KHZ400)
      is800KHz(true),
#endif
      begun(false), numLEDs(0), numBytes(0), pin(-1), brightness(0),
      pixels(NULL), rOffset(1), gOffset(0), bOffset(2), wOffset(1), endTime(0) {
}

/*!
  @brief   Gibt das Adafruit_NeoPixel-Objekt frei und setzt den Daten-Pin 
           zurück in den Eingangsmodus.
*/
Adafruit_NeoPixel::~Adafruit_NeoPixel() {
#ifdef ARDUINO_ARCH_ESP32
  // Release RMT resources (RMT channels and led_data)
  // by indirectly calling into espShow()
  memset(pixels, 0, numBytes);
  numLEDs = numBytes = 0;
  show();
#endif


#if defined(ARDUINO_ARCH_RP2040)
  // Release any PIO
  rp2040releasePIO();
#endif

  free(pixels);
  if (pin >= 0)
    pinMode(pin, INPUT);
}

/*!
  @brief   Konfiguriert den NeoPixel-Pin als Ausgang.
  @returns Gibt false zurück, wenn die benötigten Ressourcen nicht zugewiesen werden konnten.
*/
bool Adafruit_NeoPixel::begin(void) {
  if (pin >= 0) {
    pinMode(pin, OUTPUT);
    digitalWrite(pin, LOW);
  } else {
    begun = false;
    return false;
  }

#if defined(ARDUINO_ARCH_RP2040)
  // if we're calling begin() again, unclaim any existing PIO resc.
  rp2040releasePIO();
  if (! rp2040claimPIO()) {
    begun = false;
    return false;
  }
  
#endif

  begun = true;
  return true;
}

/*!
  @brief   Ändert die Länge eines bereits deklarierten Adafruit_NeoPixel-Streifen-Objekts. 
           Alte Daten werden freigegeben, neue Daten werden geleert. 
           Die Pin-Nummer und das Pixelformat bleiben unverändert.
  @param   n  Neue Länge des LED-Streifens (Anzahl der Pixel)
  @note    Diese Funktion ist veraltet und nur für die Kompatibilität mit älteren Projekten enthalten.  
           Neue Projekte sollten die Konstruktor-Syntax mit Länge, Pin und Typ verwenden.
*/
void Adafruit_NeoPixel::updateLength(uint16_t n) {
  free(pixels); // Free existing data (if any)

  // Allocate new data -- note: ALL PIXELS ARE CLEARED
  numBytes = n * ((wOffset == rOffset) ? 3 : 4);
  if ((pixels = (uint8_t *)malloc(numBytes))) {
    memset(pixels, 0, numBytes);
    numLEDs = n;
  } else {
    numLEDs = numBytes = 0;
  }
}

/*!
  @brief   Ändert das zuvor deklarierte Pixelformat eines 
           Adafruit_NeoPixel-Streifen-Objekts. Wenn das Format von einer 
           RGB-Variante zu einer RGBW-Variante (oder umgekehrt von RGBW zu RGB) 
           geändert wird, werden die alten Daten freigegeben und neue Daten 
           geleert. Andernfalls bleiben die alten Daten im RAM bestehen und 
           werden nicht in die neue Reihenfolge des Formats umsortiert.  
           Daher wird empfohlen, anschließend clear() auszuführen.
  @param   t  Pixeltyp – Summe der NEO_* Konstanten (definiert in Adafruit_NeoPixel.h).  
              Beispiel: NEO_GRB + NEO_KHZ800 bedeutet, dass NeoPixels einen 
              800-kHz-Datenstrom (anstatt 400 kHz) erwarten und die Farbreihenfolge 
              der Bytes Grün, Rot, Blau ist.
  @note    Diese Funktion ist veraltet und nur für alte Projekte enthalten, 
           die sie möglicherweise noch verwenden.  
           Neue Projekte sollten den „new“-Operator zusammen mit der 
           Konstruktor-Syntax (Länge, Pin, Typ) verwenden.
*/
void Adafruit_NeoPixel::updateType(neoPixelType t) {
  bool oldThreeBytesPerPixel = (wOffset == rOffset); // false if RGBW

  wOffset = (t >> 6) & 0b11; // See notes in header file
  rOffset = (t >> 4) & 0b11; // regarding R/G/B/W offsets
  gOffset = (t >> 2) & 0b11;
  bOffset = t & 0b11;
#if defined(NEO_KHZ400)
  is800KHz = (t < 256); // 400 KHz flag is 1<<8
#endif

