druckgott/bambulab_ams_diy_esp32/src/Adafruit_NeoPixel.cpp
  // If bytes-per-pixel has changed (and pixel data was previously
  // allocated), re-allocate to new size. Will clear any data.
  if (pixels) {
    bool newThreeBytesPerPixel = (wOffset == rOffset);
    if (newThreeBytesPerPixel != oldThreeBytesPerPixel)
      updateLength(numLEDs);
  }
}


#if defined(ARDUINO_ARCH_CH32)

// F_CPU is defined to SystemCoreClock (not constant number)
#if SYSCLK_FREQ_144MHz_HSE == 144000000 || SYSCLK_FREQ_HSE == 144000000 || \
  SYSCLK_FREQ_144MHz_HSI == 144000000 || SYSCLK_FREQ_HSI == 144000000
#define CH32_F_CPU 144000000

#elif SYSCLK_FREQ_120MHz_HSE == 120000000 || SYSCLK_FREQ_HSE == 120000000 || \
  SYSCLK_FREQ_120MHz_HSI == 120000000 || SYSCLK_FREQ_HSI == 120000000
#define CH32_F_CPU 120000000

#elif SYSCLK_FREQ_96MHz_HSE == 96000000 || SYSCLK_FREQ_HSE == 96000000 || \
  SYSCLK_FREQ_96MHz_HSI == 96000000 || SYSCLK_FREQ_HSI == 96000000
#define CH32_F_CPU 96000000

#elif SYSCLK_FREQ_72MHz_HSE == 72000000 || SYSCLK_FREQ_HSE == 72000000 || \
  SYSCLK_FREQ_72MHz_HSI == 72000000 || SYSCLK_FREQ_HSI == 72000000
#define CH32_F_CPU 72000000

#elif SYSCLK_FREQ_56MHz_HSE == 56000000 || SYSCLK_FREQ_HSE == 56000000 || \
  SYSCLK_FREQ_56MHz_HSI == 56000000 || SYSCLK_FREQ_HSI == 56000000
#define CH32_F_CPU 56000000

#elif SYSCLK_FREQ_48MHz_HSE == 48000000 || SYSCLK_FREQ_HSE == 48000000 || \
  SYSCLK_FREQ_48MHz_HSI == 48000000 || SYSCLK_FREQ_HSI == 48000000
#define CH32_F_CPU 48000000

#endif

static void ch32Show(GPIO_TypeDef* ch_port, uint32_t ch_pin, uint8_t* pixels, uint32_t numBytes, bool is800KHz) {
  // not support 400khz
  if (!is800KHz) return;

  volatile uint32_t* set = &ch_port->BSHR;
  volatile uint32_t* clr = &ch_port->BCR;

  uint8_t* ptr = pixels;
  uint8_t* end = ptr + numBytes;
  uint8_t p = *ptr++;
  uint8_t bitMask = 0x80;

  // NVIC_DisableIRQ(SysTicK_IRQn);

  while (1) {
    if (p & bitMask) { // ONE
      // High 800ns
      *set = ch_pin;
      __asm volatile ("nop; nop; nop; nop; nop; nop; nop; nop;"
        "nop; nop; nop; nop; nop; nop; nop; nop;"
        "nop; nop; nop; nop; nop; nop; nop; nop;"
        "nop; nop; nop; nop; nop; nop; nop; nop;"
        "nop; nop; nop; nop; nop; nop; nop; nop;"
        "nop;"
#if CH32_F_CPU >= 72000000
        "nop; nop; nop; nop; nop; nop; nop;"
        "nop; nop; nop; nop; nop; nop;"
#endif
#if CH32_F_CPU >= 96000000
        "nop; nop;"
        "nop; nop; nop; nop; nop; nop; nop; nop;"
        "nop; nop; nop; nop; nop; nop; nop; nop;"
#endif
#if CH32_F_CPU >= 120000000
        "nop; nop; nop; nop; nop; nop; nop; nop;"
        "nop; nop; nop; nop; nop; nop; nop; nop;"
        "nop; nop; nop; nop; nop; nop; nop; nop;"
#endif
#if CH32_F_CPU >= 144000000
        "nop; nop; nop; nop; nop; nop; nop; nop;"
        "nop; nop; nop; nop; nop; nop; nop; nop;"
#endif
        );

      // Low 450ns
      *clr = ch_pin;
      __asm volatile ("nop; nop; nop; nop; nop; nop; nop; nop;"
        "nop; nop; nop; nop; nop; nop; nop; nop;"
        "nop;"
#if CH32_F_CPU >= 72000000
        "nop; nop; nop; nop; nop; nop; nop; nop; nop;"
#endif
#if CH32_F_CPU >= 96000000
        "nop; nop; nop; nop; nop; nop;"
#endif
#if CH32_F_CPU >= 120000000
        "nop; nop; nop; nop; nop;"
        "nop; nop; nop; nop; nop; nop; nop; nop;"
#endif
#if CH32_F_CPU >= 144000000
        "nop; nop; nop; nop; nop; nop; nop; nop; nop; nop; nop; nop;"
#endif
        );
    } else {   // ZERO
      // High 400ns
      *set = ch_pin;
      __asm volatile ("nop; nop; nop; nop; nop; nop; nop; nop;"
        "nop; nop; nop; nop; nop; nop; nop; nop;"
        "nop;"
#if CH32_F_CPU >= 72000000
        "nop; nop; nop; nop; nop; nop; nop;"
#endif
#if CH32_F_CPU >= 96000000
        "nop; nop; nop; nop; nop; nop; nop; nop;"
#endif
#if CH32_F_CPU >= 120000000
        "nop; nop; nop; "
        "nop; nop; nop; nop; nop; nop; nop; nop;"
#endif
#if CH32_F_CPU >= 144000000
        "nop; nop; nop; nop; nop; nop; nop; nop; nop; nop; nop;"
#endif
        );

      // Low 850ns
      *clr = ch_pin;
      __asm volatile ("nop; nop; nop; nop; nop; nop; nop; nop;"
        "nop; nop; nop; nop; nop; nop; nop; nop;"
        "nop; nop; nop; nop; nop; nop; nop; nop;"
        "nop; nop; nop; nop; nop; nop; nop; nop;"
        "nop; nop; nop; nop; nop;"
#if CH32_F_CPU >= 72000000
        "nop; nop; nop;"
        "nop; nop; nop; nop; nop; nop; nop; nop;"
#endif
#if CH32_F_CPU >= 96000000
        "nop; nop; nop; nop; nop; nop; nop; nop;"
        "nop; nop; nop; nop; nop; nop; nop; nop;"
        "nop; nop; nop; nop; nop; nop;"
#endif
#if CH32_F_CPU >= 120000000
        "nop; nop; nop; nop; nop; nop; nop; nop;"
        "nop; nop; nop; nop; nop; nop; nop; nop;"
        "nop; nop; nop; nop; nop; nop;"
#endif
#if CH32_F_CPU >= 144000000
        "nop; nop; nop; nop;"
        "nop; nop; nop; nop; nop; nop; nop; nop; nop; nop; nop;"
#endif
        );
    }

    if (bitMask >>= 1) {
      // Move on to the next pixel
      asm("nop;");
    }
    else {
      if (ptr >= end) {
        break;
      }
      p = *ptr++;
      bitMask = 0x80;
    }
  }

  // NVIC_EnableIRQ(SysTicK_IRQn);
}
#endif

#if defined(ESP8266)
// ESP8266 show() is external to enforce ICACHE_RAM_ATTR execution
extern "C" IRAM_ATTR void espShow(uint16_t pin, uint8_t *pixels,
                                  uint32_t numBytes, uint8_t type);
#elif defined(ESP32)
extern "C" void espShow(uint16_t pin, uint8_t *pixels, uint32_t numBytes,
                        uint8_t type);

#endif // ESP8266

#if defined(K210)
#define KENDRYTE_K210 1
#endif

#if defined(KENDRYTE_K210)
extern "C" void k210Show(uint8_t pin, uint8_t *pixels, uint32_t numBytes,
                         boolean is800KHz);
#endif // KENDRYTE_K210
/*!
  @brief   Überträgt die Pixeldaten aus dem RAM zu den NeoPixels.
  @note    Auf den meisten Architekturen werden Interrupts vorübergehend deaktiviert, 
           um das korrekte NeoPixel-Signal-Timing zu gewährleisten.  
           Das bedeutet, dass die Arduino-Funktionen millis() und micros(), 
           die auf Interrupts angewiesen sind, währenddessen kleine Zeitspannen 
           verlieren. Pro RGB-Pixel beträgt dies ungefähr 30 Mikrosekunden, 
           bei RGBW-Pixeln etwa 40 Mikrosekunden.  
           Für dieses Problem gibt es keine einfache Lösung, allerdings existieren 
           spezielle alternative oder ergänzende Bibliotheken, die sehr 
           gerätespezifische Peripherie nutzen, um es zu umgehen.
*/
void Adafruit_NeoPixel::show(void) {

  if (!pixels)
    return;

  // Data latch = 300+ microsecond pause in the output stream. Rather than
  // put a delay at the end of the function, the ending time is noted and
  // the function will simply hold off (if needed) on issuing the
  // subsequent round of data until the latch time has elapsed. This
  // allows the mainline code to start generating the next frame of data
  // rather than stalling for the latch.
  while (!canShow())
    ;
    // endTime is a private member (rather than global var) so that multiple
    // instances on different pins can be quickly issued in succession (each
    // instance doesn't delay the next).

