druckgott/bambulab_ams_diy_esp32/src/Adafruit_NeoPixel.cpp
#if defined(PORTD) || defined(PORTB) || defined(PORTF)
    }
#endif // defined(PORTD/B/F)
#if defined(PORTF)
    else
#endif
#endif // defined(PORTC)

    // PORTF OUTPUT ----------------------------------------------------

#if defined(PORTF)
#if defined(PORTD) || defined(PORTB) || defined(PORTC)
        if (port == &PORTF) {
#endif // defined(PORTD/B/C)

      hi = PORTF | pinMask;
      lo = PORTF & ~pinMask;
      next = lo;
      if (b & 0x80)
        next = hi;

      // Same as above, just set for PORTF & stripped of comments
      asm volatile("headF:"
                   "\n\t"
                   "out   %[port], %[hi]"
                   "\n\t"
                   "rcall bitTimeC"
                   "\n\t"
                   "out   %[port], %[hi]"
                   "\n\t"
                   "rcall bitTimeC"
                   "\n\t"
                   "out   %[port], %[hi]"
                   "\n\t"
                   "rcall bitTimeC"
                   "\n\t"
                   "out   %[port], %[hi]"
                   "\n\t"
                   "rcall bitTimeC"
                   "\n\t"
                   "out   %[port], %[hi]"
                   "\n\t"
                   "rcall bitTimeC"
                   "\n\t"
                   "out   %[port], %[hi]"
                   "\n\t"
                   "rcall bitTimeC"
                   "\n\t"
                   "out   %[port], %[hi]"
                   "\n\t"
                   "rcall bitTimeC"
                   "\n\t"
                   "out  %[port] , %[hi]"
                   "\n\t"
                   "rjmp .+0"
                   "\n\t"
                   "ld   %[byte] , %a[ptr]+"
                   "\n\t"
                   "out  %[port] , %[next]"
                   "\n\t"
                   "mov  %[next] , %[lo]"
                   "\n\t"
                   "sbrc %[byte] , 7"
                   "\n\t"
                   "mov %[next] , %[hi]"
                   "\n\t"
                   "nop"
                   "\n\t"
                   "out  %[port] , %[lo]"
                   "\n\t"
                   "sbiw %[count], 1"
                   "\n\t"
                   "brne headF"
                   "\n\t"
                   "rjmp doneC"
                   "\n\t"
                   "bitTimeC:"
                   "\n\t"
                   "out  %[port], %[next]"
                   "\n\t"
                   "mov  %[next], %[lo]"
                   "\n\t"
                   "rol  %[byte]"
                   "\n\t"
                   "sbrc %[byte], 7"
                   "\n\t"
                   "mov %[next], %[hi]"
                   "\n\t"
                   "nop"
                   "\n\t"
                   "out  %[port], %[lo]"
                   "\n\t"
                   "ret"
                   "\n\t"
                   "doneC:"
                   "\n"
                   : [byte] "+r"(b), [next] "+r"(next), [count] "+w"(i)
                   : [port] "I"(_SFR_IO_ADDR(PORTF)), [ptr] "e"(ptr),
                     [hi] "r"(hi), [lo] "r"(lo));

#if defined(PORTD) || defined(PORTB) || defined(PORTC)
    }
#endif // defined(PORTD/B/C)
#endif // defined(PORTF)

#if defined(NEO_KHZ400)
  } else { // 400 KHz

    // 30 instruction clocks per bit: HHHHHHxxxxxxxxxLLLLLLLLLLLLLLL
    // ST instructions:               ^     ^        ^    (T=0,6,15)

    volatile uint8_t next, bit;

    hi = *port | pinMask;
    lo = *port & ~pinMask;
    next = lo;
    bit = 8;

    asm volatile("head30:"
                 "\n\t" // Clk  Pseudocode    (T =  0)
                 "st   %a[port], %[hi]"
                 "\n\t" // 2    PORT = hi     (T =  2)
                 "sbrc %[byte] , 7"
                 "\n\t" // 1-2  if(b & 128)
                 "mov  %[next], %[hi]"
                 "\n\t" // 0-1   next = hi    (T =  4)
                 "rjmp .+0"
                 "\n\t" // 2    nop nop       (T =  6)
                 "st   %a[port], %[next]"
                 "\n\t" // 2    PORT = next   (T =  8)
                 "rjmp .+0"
                 "\n\t" // 2    nop nop       (T = 10)
                 "rjmp .+0"
                 "\n\t" // 2    nop nop       (T = 12)
                 "rjmp .+0"
                 "\n\t" // 2    nop nop       (T = 14)
                 "nop"
                 "\n\t" // 1    nop           (T = 15)
                 "st   %a[port], %[lo]"
                 "\n\t" // 2    PORT = lo     (T = 17)
                 "rjmp .+0"
                 "\n\t" // 2    nop nop       (T = 19)
                 "dec  %[bit]"
                 "\n\t" // 1    bit--         (T = 20)
                 "breq nextbyte30"
                 "\n\t" // 1-2  if(bit == 0)
                 "rol  %[byte]"
                 "\n\t" // 1    b <<= 1       (T = 22)
                 "rjmp .+0"
                 "\n\t" // 2    nop nop       (T = 24)
                 "rjmp .+0"
                 "\n\t" // 2    nop nop       (T = 26)
                 "rjmp .+0"
                 "\n\t" // 2    nop nop       (T = 28)
                 "rjmp head30"
                 "\n\t" // 2    -> head30 (next bit out)
                 "nextbyte30:"
                 "\n\t" //                    (T = 22)
                 "nop"
                 "\n\t" // 1    nop           (T = 23)
                 "ldi  %[bit]  , 8"
                 "\n\t" // 1    bit = 8       (T = 24)
                 "ld   %[byte] , %a[ptr]+"
                 "\n\t" // 2    b = *ptr++    (T = 26)
                 "sbiw %[count], 1"
                 "\n\t" // 2    i--           (T = 28)
                 "brne head30"
                 "\n" // 1-2  if(i != 0) -> (next byte)
                 : [port] "+e"(port), [byte] "+r"(b), [bit] "+r"(bit),
                   [next] "+r"(next), [count] "+w"(i)
                 : [hi] "r"(hi), [lo] "r"(lo), [ptr] "e"(ptr));
  }
#endif // NEO_KHZ400

// 16 MHz(ish) AVR --------------------------------------------------------
#elif (F_CPU >= 15400000UL) && (F_CPU <= 19000000L)

#if defined(NEO_KHZ400) // 800 KHz check needed only if 400 KHz support enabled
  if (is800KHz) {
#endif

    // WS2811 and WS2812 have different hi/lo duty cycles; this is
    // similar but NOT an exact copy of the prior 400-on-8 code.

