druckgott/bambulab_ams_diy_esp32/src/Adafruit_NeoPixel.cpp
      // .justbit: ; C10
      "L%=_justbit:"
      "\n\t" //; C10
      //    ; no nops, branch taken is already 3 cycles
      //    b .common ; C13
      "b L%=_common"
      "\n\t" //; C13

      // .stop:
      "L%=_stop:"
      "\n\t"
      //    str r1, [r2, #0]   ; pin := lo
      "str %[bitmask], [%[reg], #4]"
      "\n\t" //; pin := lo
      //    cpsie i            ; enable irq

      : [p] "+r"(p), [pix] "=&r"(pix), [count] "=&r"(count), [mask] "=&r"(mask),
        [num] "+r"(num)
      : [bitmask] "r"(bitmask), [reg] "r"(reg));

#elif defined(__SAM3X8E__) // Arduino Due

#define SCALE VARIANT_MCK / 2UL / 1000000UL
#define INST (2UL * F_CPU / VARIANT_MCK)
#define TIME_800_0 ((int)(0.40 * SCALE + 0.5) - (5 * INST))
#define TIME_800_1 ((int)(0.80 * SCALE + 0.5) - (5 * INST))
#define PERIOD_800 ((int)(1.25 * SCALE + 0.5) - (5 * INST))
#define TIME_400_0 ((int)(0.50 * SCALE + 0.5) - (5 * INST))
#define TIME_400_1 ((int)(1.20 * SCALE + 0.5) - (5 * INST))
#define PERIOD_400 ((int)(2.50 * SCALE + 0.5) - (5 * INST))

  int pinMask, time0, time1, period, t;
  Pio *port;
  volatile WoReg *portSet, *portClear, *timeValue, *timeReset;
  uint8_t *p, *end, pix, mask;

  pmc_set_writeprotect(false);
  pmc_enable_periph_clk((uint32_t)TC3_IRQn);
  TC_Configure(TC1, 0,
               TC_CMR_WAVE | TC_CMR_WAVSEL_UP | TC_CMR_TCCLKS_TIMER_CLOCK1);
  TC_Start(TC1, 0);

  pinMask = g_APinDescription[pin].ulPin;  // Don't 'optimize' these into
  port = g_APinDescription[pin].pPort;     // declarations above. Want to
  portSet = &(port->PIO_SODR);             // burn a few cycles after
  portClear = &(port->PIO_CODR);           // starting timer to minimize
  timeValue = &(TC1->TC_CHANNEL[0].TC_CV); // the initial 'while'.
  timeReset = &(TC1->TC_CHANNEL[0].TC_CCR);
  p = pixels;
  end = p + numBytes;
  pix = *p++;
  mask = 0x80;

#if defined(NEO_KHZ400) // 800 KHz check needed only if 400 KHz support enabled
  if (is800KHz) {
#endif
    time0 = TIME_800_0;
    time1 = TIME_800_1;
    period = PERIOD_800;
#if defined(NEO_KHZ400)
  } else { // 400 KHz bitstream
    time0 = TIME_400_0;
    time1 = TIME_400_1;
    period = PERIOD_400;
  }
#endif

  for (t = time0;; t = time0) {
    if (pix & mask)
      t = time1;
    while (*timeValue < (unsigned)period)
      ;
    *portSet = pinMask;
    *timeReset = TC_CCR_CLKEN | TC_CCR_SWTRG;
    while (*timeValue < (unsigned)t)
      ;
    *portClear = pinMask;
    if (!(mask >>= 1)) { // This 'inside-out' loop logic utilizes
      if (p >= end)
        break; // idle time to minimize inter-byte delays.
      pix = *p++;
      mask = 0x80;
    }
  }
  while (*timeValue < (unsigned)period)
    ; // Wait for last bit
  TC_Stop(TC1, 0);


// RENESAS including Arduino UNO R4 + STM32H7 Arduino Portenta H7 (Dual Core M7+M4) / Arduino Giga R1
#elif defined(ARDUINO_ARCH_RENESAS) || defined(ARDUINO_ARCH_RENESAS_UNO) || defined(ARDUINO_ARCH_RENESAS_PORTENTA) || defined(ARDUINO_ARCH_MBED_PORTENTA) || defined(ARDUINO_ARCH_MBED_GIGA)

// Definition for a single channel clockless controller for RA4M1 (Cortex M4)
// See clockless.h for detailed info on how the template parameters are used.
#define ARM_DEMCR               (*(volatile uint32_t *)0xE000EDFC) // Debug Exception and Monitor Control
#define ARM_DEMCR_TRCENA                (1 << 24)        // Enable debugging & monitoring blocks
#define ARM_DWT_CTRL            (*(volatile uint32_t *)0xE0001000) // DWT control register
#define ARM_DWT_CTRL_CYCCNTENA          (1 << 0)                // Enable cycle count
#define ARM_DWT_CYCCNT          (*(volatile uint32_t *)0xE0001004) // Cycle count register

#if defined(ARDUINO_PORTENTA_H7_M7) || defined(ARDUINO_GIGA)
#define F_CPU 480000000
#elif defined(ARDUINO_PORTENTA_H7_M4)
#define F_CPU 240000000
#else
#define F_CPU 48000000
#endif
#define CYCLES_800_T0H (F_CPU / 4000000)
#define CYCLES_800_T1H (F_CPU / 1250000)
#define CYCLES_800 (F_CPU / 800000)
#define CYCLES_400_T0H (F_CPU / 2000000)
#define CYCLES_400_T1H (F_CPU / 833333)
#define CYCLES_400 (F_CPU / 400000)

  uint8_t *p = pixels, *end = p + numBytes, pix, mask;

// --- Platform-specific Pin Setup ---
#if defined(ARDUINO_ARCH_MBED_PORTENTA) || defined(ARDUINO_ARCH_MBED_GIGA)
  // Convert the Arduino pin number to an mbed PinName.
  mbed::DigitalOut dout(digitalPinToPinName(pin));
#else
  bsp_io_port_pin_t io_pin = g_pin_cfg[pin].pin;
  // Macro to calculate the port base address for the given pin
  #define PIN_IO_PORT_ADDR(pn)      (R_PORT0 + ((uint32_t) (R_PORT1 - R_PORT0) * ((pn) >> 8u)))

  volatile uint16_t *set = &(PIN_IO_PORT_ADDR(io_pin)->POSR);
  volatile uint16_t *clr = &(PIN_IO_PORT_ADDR(io_pin)->PORR);
  uint16_t msk = (1U << (io_pin & 0xFF));
#endif

  uint32_t cyc;

  // Enable the cycle counter: ARM registers for precise timing.
  ARM_DEMCR |= ARM_DEMCR_TRCENA;
  ARM_DWT_CTRL |= ARM_DWT_CTRL_CYCCNTENA;

#if defined(NEO_KHZ400) // 800 KHz check needed only if 400 KHz support enabled
  if (is800KHz) {
#endif
    cyc = ARM_DWT_CYCCNT + CYCLES_800;
    while (p < end) {
      pix = *p++;
      for (mask = 0x80; mask; mask >>= 1) {
        // Wait until the beginning of the next bit period.
        while (ARM_DWT_CYCCNT - cyc < CYCLES_800)
          ;
        cyc = ARM_DWT_CYCCNT;
        // Set the pin high:
#if defined(ARDUINO_ARCH_MBED_PORTENTA) || defined(ARDUINO_ARCH_MBED_GIGA)
        dout = 1;
#else
        *set = msk;
#endif
        // Keep the pin high for T1H or T0H depending on the data bit:
        if (pix & mask) {
          while (ARM_DWT_CYCCNT - cyc < CYCLES_800_T1H)
            ;
        } else {
          while (ARM_DWT_CYCCNT - cyc < CYCLES_800_T0H)
            ;
        }
        // Set the pin low:
#if defined(ARDUINO_ARCH_MBED_PORTENTA) || defined(ARDUINO_ARCH_MBED_GIGA)
        dout = 0;
#else
        *clr = msk;
#endif
      }
    }
    // Ensure the final low state lasts the full period.
    while (ARM_DWT_CYCCNT - cyc < CYCLES_800)
      ;
#if defined(NEO_KHZ400)
  } else { // 400 kHz bitstream
    cyc = ARM_DWT_CYCCNT + CYCLES_400;
    while (p < end) {
      pix = *p++;
      for (mask = 0x80; mask; mask >>= 1) {
        while (ARM_DWT_CYCCNT - cyc < CYCLES_400)
          ;
        cyc = ARM_DWT_CYCCNT;
        // Set the pin high:
#if defined(ARDUINO_ARCH_MBED_PORTENTA) || defined(ARDUINO_ARCH_MBED_GIGA)
        dout = 1;
#else
        *set = msk;
#endif
        if (pix & mask) {
          while (ARM_DWT_CYCCNT - cyc < CYCLES_400_T1H)
            ;
        } else {
          while (ARM_DWT_CYCCNT - cyc < CYCLES_400_T0H)
            ;
        }
        // Set the pin low:
#if defined(ARDUINO_ARCH_MBED_PORTENTA) || defined(ARDUINO_ARCH_MBED_GIGA)
        dout = 0;
#else
        *clr = msk;
#endif
      }
    }
    // Ensure the final low state lasts the full period.
    while (ARM_DWT_CYCCNT - cyc < CYCLES_400)
      ;
  }
#endif // NEO_KHZ400

#endif // ARM

  // END ARM ----------------------------------------------------------------

#elif defined(ESP8266) || defined(ESP32)

  // ESP8266 ----------------------------------------------------------------

  // ESP8266 show() is external to enforce ICACHE_RAM_ATTR execution
  espShow(pin, pixels, numBytes, is800KHz);

